Tekla Open API Reference for Tekla Structures 2025
ProjectInfo.SetUserProperty Method
Overload List
Name | Description
SetUserProperty(String, Double)
 Sets a double property for the ProjectInfo.
SetUserProperty(String, Int32)
 Sets an integer property for the ProjectInfo.
SetUserProperty(String, String)
 Sets a string property for the ProjectInfo.
Top
See Also
Reference
ProjectInfo Class
Tekla.Structures.Model Namespace